---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyList
source: html/fc63cb50-2938-4804-3a03-b0af6c122fc9.htm
---
# AssetPropertyList Members

Adds a new connected asset attached to this asset property, if it allows it.